#include <stdio.h>

#define LENGTH_S 12
#define ROW_G 12
#define COLUMN_G 10

// 定义一个计算 给定深度下最大采金量 的函数，返回采金总量
int find_max_gold(int);

// 存储挖掘路径，长度12，注意题目从S[1]开始，此处调整为S[0]开始
int S[LENGTH_S] = {0};

// 打印S
void print_S(int);

// 存储金矿数据，12行，10列
int G[ROW_G][COLUMN_G] = {
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,2,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,3,0},
    {0,0,3,0,0,0,0,0,0,0},
    {6,0,0,0,2,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,6,0,0,0},
    {0,0,0,0,0,5,0,0,0,0},
    {0,0,0,9,0,0,0,0,2,0},
    {0,0,0,0,7,0,0,0,3,0},
    {0,0,0,0,0,0,0,0,0,0},
};

// 记录挖掘机从上方到达该位置时，最多可以得到多少金矿
int save_gold[ROW_G][COLUMN_G] = {
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
};

// 记录挖掘机从上方到达该位置时，最后一步的方向，1为左下，0位正下，2为右下
int save_direction[ROW_G][COLUMN_G] = {
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
};

int main()
{   
    S[0] = 4; // 题目指定起始位置
    int depth = 10; //设定不同的深度，深度从1开始，1-12
    int total_gold = 0;
    total_gold = find_max_gold(depth);
    printf("深度 %d 时的采金总量是：%d\n", depth, total_gold);
    print_S(depth);
    return 0;
}

void print_S(int depth)
{   
    printf("路径是：\n");
    for (int i = 0; i < depth; i++) {
        printf("第%2d行坐标：(%2d, %2d)\n", i + 1, i, S[i]);
    }
}

int find_max_gold(int depth)
{
    int gold = 0;
    if(depth == 1) {
        // 深度为1的时候 返回起始位置所在的金矿数量
        // 并更新save_gold表
        save_gold[0][S[0]] = G[0][S[0]];
        gold = save_gold[0][S[0]];
    } else if (depth > 1) {
        // 遍历该行，找到每一个有金矿(非0)的格子
        for (int i = 0; i < COLUMN_G; i++)
        {
            /* code */
        }
        

    }

    return gold;
}